# Python Data, 2024

---

* [Spojov치n칤 dat](#Spojov%C3%A1n%C3%AD-dat),
    - [spojov치n칤 s CONCAT](#Spojov치n칤-s-CONCAT),
    - [spojov치n칤 s CONCAT a JOIN](#concat-a-voliteln칳-argument-join),
    - [spojov치n칤 s metodou APPEND](#Spojov치n칤-pomoc칤-metody-APPEND),
    - [spojov치n칤 s MERGE](#Spojov치n칤-pomoc칤-merge),
    - [spojov치n칤 s metodou JOIN](#Spojen칤-pomoc칤-index콢,-join),
* [Agregace](#Agregace),
    - [jednoduch치 agregace](#Jednoduch치-agregace),
    - [seskupov치n칤 GROUPBY](#Seskupov치n칤-groupby),
    - [agregace](#Agregace-s-metodami),
    - [filtrov치n칤](#Filtrov치n칤),
    - [transformace](#Transformace),
    - [apply](#Metoda-apply),
* [Pivot tabulka](#Pivot-tabulky),
    - [칰vodn칤 motivace](),
    - [syntaxe tabulky](),
    - [dopl켿uj칤c칤 mo쬹osti](),
    - [cvi캜en칤 3]().



<img src="https://external-content.duckduckgo.com/iu/?u=https%3A%2F%2Ftse1.mm.bing.net%2Fth%3Fid%3DOIP.APOjuHGvkM0wQaUx9ELKAgHaHa%26pid%3DApi&f=1&ipt=a8b2b692c40e190d4b28c164bf13e6c944702a69944035a4ef9053aa6ea1b190&ipo=images" width="160" style="margin-left:auto; margin-right:auto"/>

<br>

## Spojov치n칤 dat

---

Takov칳mi operacemi si m콢쬰코 p콏edstavit jednoduch칠 operace jako **spojov치n칤** (*konkatenace*) **dvou a v칤ce dataset콢** a po slo쬴t캩j코칤 *JOINY* podobn캩 jako u datab치z칤.

`pandas` obsahuje r콢zn칠 *funkce* a *metody*, kter칠 umo쮄갓j칤 tento zp콢sob pr치ce.

* funkce `concat`,
* funkce `merge`,
* metoda `append` (outdated),
* metoda `join`.

### Spojov치n칤 s CONCAT

---

Funkce `concat()` v `pandas` umo쮄갓je spojit **dva nebo v칤ce**:
1. **sloupe캜k콢** tabulky,
    - *horizont치ln캩*, po sloupc칤ch,
    - *vertik치ln캩*, po Indexech,
3. **tabulek** samotn칳ch,
    - *horizont치ln캩*, po sloupc칤ch,
    - *vertik치ln캩*, po Indexech,

Pou쬴t칤 funkce `concat()` spo캜칤v치 **v p콏ed치n칤 seznamu objekt콢**, kter칠 chce코 spojit, a parametru `axis`, kter칳 ur캜uje osu, podle kter칠 se m치j칤 objekty spojit:

#### Spojen칤 sloupe캜k콢, CONCAT

---

In [1]:
from pandas import concat, Series, DataFrame

In [2]:
sloupec_1 = Series(['A', 'B', 'C'], index=[1, 2, 3])
sloupec_2 = Series(['D', 'E', 'F'], index=[4, 5, 6])

In [3]:
sloupec_1

1    A
2    B
3    C
dtype: object

In [4]:
sloupec_2

4    D
5    E
6    F
dtype: object

In [5]:
spojene_sloupce = concat([sloupec_1, sloupec_2])

<br>

Spojen칤 **horizont치ln칤** (pod sebou):

In [6]:
horizontalni_spoj = concat([sloupec_1, sloupec_2], axis=1)

In [7]:
horizontalni_spoj

     0    1
1    A  NaN
2    B  NaN
3    C  NaN
4  NaN    D
5  NaN    E
6  NaN    F

<br>

Spojen칤 **vertik치ln칤** (vedle sebe):

In [8]:
vertikalni_spoj = concat([sloupec_1, sloupec_2], axis=0)

In [9]:
vertikalni_spoj

1    A
2    B
3    C
4    D
5    E
6    F
dtype: object

<br>

#### Spojen칤 tabulek, CONCAT

---

In [12]:
uzivatele_tab_1 = {'jmeno': ['Matou코', 'Marek', 'Luk치코'],
               'vek': [25, 30, 35]}

In [13]:
uzivatele_tab_2 = {'jmeno': ['Petr', 'Jan', 'Michal'],
                   'vek': [40, 45, 50]}

In [14]:
uzivatele_tab_1_df = DataFrame(uzivatele_tab_1)
uzivatele_tab_2_df = DataFrame(uzivatele_tab_2)

In [15]:
uzivatele_tab_1_df

    jmeno  vek
0  Matou코   25
1   Marek   30
2   Luk치코   35

In [16]:
uzivatele_tab_2_df

    jmeno  vek
0    Petr   40
1     Jan   45
2  Michal   50


#### Samotn칠 spojen칤 dvou tabulek

---

In [17]:
df_spojene_tab = concat([uzivatele_tab_1_df, uzivatele_tab_2_df], axis=0)

In [18]:
df_spojene_tab

    jmeno  vek
0  Matou코   25
1   Marek   30
2   Luk치코   35
0    Petr   40
1     Jan   45
2  Michal   50

#### Co s duplicitn칤mi Indexy?

---

Tady se ov코em **zduplikovali hodnoty** n캩kter칳ch index콢.

Ty je pot콏eba opravit t칤mto postupem:
1. **Vytvo콏칤m nov칳 sloupe캜ek** pro indexy,
2. **odstran칤m star칳 sloupe캜ek** s duplicitami.

In [19]:
df_spojene_tab = df_spojene_tab.reset_index()  # P콏id치 nov칳 Index

In [20]:
df_spojene_tab

   index   jmeno  vek
0      0  Matou코   25
1      1   Marek   30
2      2   Luk치코   35
3      0    Petr   40
4      1     Jan   45
5      2  Michal   50

In [22]:
df_spojene_tab = df_spojene_tab.drop("index", axis=1)

<br>

Kontrola nov칠ho rozsahu **pro Index**:

In [24]:
df_spojene_tab.index

RangeIndex(start=0, stop=6, step=1)

<br>

Poz콢statky sloupe캜k콢:

In [25]:
df_spojene_tab.columns

Index(['jmeno', 'vek'], dtype='object')

In [26]:
df_spojene_tab

    jmeno  vek
0  Matou코   25
1   Marek   30
2   Luk치코   35
3    Petr   40
4     Jan   45
5  Michal   50

<br>

Nastaven칤 nov칳ch Index콢 **podle jmen**:

In [31]:
df_spojene_tab.index.names?

Type:        property
String form: <property object at 0x7f0eb75c7c70>
Docstring:   <no docstring>

<br>

Dopln칤코 jm칠no **pro Index**:

In [33]:
df_spojene_tab.index.names = ["Index ze jm칠n"]

In [34]:
df_spojene_tab.index.names

FrozenList(['Index ze jm칠n'])

In [35]:
df_spojene_tab

                jmeno  vek
Index ze jm칠n
0              Matou코   25
1               Marek   30
2               Luk치코   35
3                Petr   40
4                 Jan   45
5              Michal   50

Pro odchyt치v치n칤 **duplicitn칤ch index콢** m콢쬰코 doplnit parametr `verify_integrity=True`, p콏칤padn캩 pokud je irelevantn칤, ignorovat jej 칰pln캩 `ignore_index=True`.

<br>

**游 CVI캛EN칈 游, procvi캜 si funkc칤 CONCAT**

In [1]:
data_populace = {
    "City": ["New York", "London", "Tokyo"],
    "Population": [8.4, 9.0, 13.9],
}

data_plocha = {
    "City": ["New York", "London", "Tokyo"],
    "Area": [783, 1572, 2194],
}

data_kontinent = {
    "City": ["New York", "London", "Tokyo"],
    "Continent": ["North America", "Europe", "Asia"],
}

# Vytvo콏 funkci "spoj_data_mest", kter치 spoj칤 3 p콏edchoz칤 DF

<details>
    <summary>郊윒잺 콎e코en칤</summary>
    
```python
from pandas import DataFrame, concat

data_populace = {
    "City": ["New York", "London", "Tokyo"],
    "Population": [8.4, 9.0, 13.9],
}

data_plocha = {
    "City": ["New York", "London", "Tokyo"],
    "Area": [783, 1572, 2194],
}

data_kontinent = {
    "City": ["New York", "London", "Tokyo"],
    "Continent": ["North America", "Europe", "Asia"],
}

populace_df = DataFrame(data_populace)
plocha_df = DataFrame(data_plocha)
kontinent_df = DataFrame(data_kontinent)


def spoj_data_mest(populace, plocha, kontinent):
    """
    Spoj칤 t콏i tabulky horizont치ln캩 podle sloupce City.
    """
    return concat([populace.set_index("City"),
                      plocha.set_index("City"),
                      kontinent.set_index("City")], axis=1).reset_index()


result = spoj_data_mest(populace_df, plocha_df, kontinent_df)
print(result)
```
</details>

<img src="https://imgs.search.brave.com/wR9sz6BPwR_LCDm6Esd_B9VgUBSbW4wbTPi2T9DrdBc/rs:fit:500:0:0:0/g:ce/aHR0cHM6Ly90NC5m/dGNkbi5uZXQvanBn/LzA4LzQwLzM1LzIx/LzM2MF9GXzg0MDM1/MjE1Ml84N1N2T0kx/REM2RElCaHkxc0xz/VnpnYmNIUk1UZno0/cC5qcGc" width="230" style="margin-left:auto; margin-right:auto"/>

### CONCAT a voliteln칳 argument JOIN

---

V jednoduch칳ch uk치zk치ch, jako jsou ty v칳코e, sta캜ilo **tabulky a sloupe캜ky spojit**.

To prakticky nen칤 v쬯y ide치ln칤 콏e코en칤, proto쬰 n캩kter칠 sloupe캜ky m콢쬺u, **ale nemus칤 b칳t shodn칠**.

In [36]:
from pandas import DataFrame, concat

In [37]:
data_tab_1_df = DataFrame(
    {"A": ["A1", "A2"], "B": ["B1", "B2"], "C": ["C1", "C2"]},
    index=[1, 2]
)

In [38]:
data_tab_2_df = DataFrame(
    {"B": ["B3", "B4"], "C": ["C3", "C4"], "D": ["D3", "D4"]},
    index=[3, 4]
)

In [39]:
data_tab_1_df

    A   B   C
1  A1  B1  C1
2  A2  B2  C2

In [40]:
data_tab_2_df

    B   C   D
3  B3  C3  D3
4  B4  C4  D4


#### Horizont치ln칤 spojen칤 dvou tabulek

---

In [41]:
vystup_tab_df = concat([data_tab_1_df, data_tab_2_df])  # axis=0

In [43]:
vystup_tab_df

     A   B   C    D
1   A1  B1  C1  NaN
2   A2  B2  C2  NaN
3  NaN  B3  C3   D3
4  NaN  B4  C4   D4

Pokud n캩kter치 data chyb캩j칤, jsou automaticky vypln캩n치 **nezn치m칳mi hodnotami**.

콎e코en칤m takov칠 situace m콢쬰코 b칳t zaveden칤 jin칠ho **zp콢sobu spojov치n칤**.

Tedy nepou쮂셨at defaultn칤 argument `join='outer'`, ale `join='inner'`:

In [51]:
vystup_bez_nan_df = concat([data_tab_1_df, data_tab_2_df],
                           join='inner',
                           axis=0)

In [52]:
vystup_bez_nan_df

    B   C
1  B1  C1
2  B2  C2
3  B3  C3
4  B4  C4

<img src="https://imgs.search.brave.com/IZ8jkD1GaDV2tXwgwzM1Xawk-jBMejygby1KcermQp8/rs:fit:500:0:0:0/g:ce/aHR0cHM6Ly90NC5m/dGNkbi5uZXQvanBn/LzA4LzQ2LzQ3LzE1/LzM2MF9GXzg0NjQ3/MTU2MF95Y281RnhM/UG5RR1c4NW1OWHBD/UmcxUWptSzRiMnp3/eS5qcGc" width="200" style="margin-left:auto; margin-right:auto"/>

### Spojov치n칤 pomoc칤 `MERGE`

---

Dal코칤 funkc칤 pro spojov치n칤 `DataFrame` objekt콢 je `merge`.

Tato funkce je vhodn치 pro spojov치n칤 DataFrame objekt콢, kter칠 **maj칤 spole캜n칠 sloupce**.

M콢쬰코 l칠pe zad치vat typ spojen칤 (parametr `how='inner' | 'outer' | 'left' | 'join'`).

D치le ti umo쬹칤 **definovat sloupec, nebo sloupce**, na kter칳ch chce코 spojen칤 prov칠st (parametr `on`).

In [53]:
from pandas import merge

In [55]:
uzivatele_tab_1 = {
    'jmeno': ['Alice', 'Bob', 'Charlie', 'David'],
    'vek': [25, 30, 35, 40],
    'mesto': ['Brno', 'Praha', 'Plzen', 'Ostrava']
}

In [56]:
uzivatele_tab_2 = {
    'jmeno': ['Alice', 'David', 'Emma', 'Frank'],
    'pocet_prijemcu': [100, 200, 150, 250]
}

In [57]:
uzivatele_tab_1_df = DataFrame(uzivatele_tab_1)
uzivatele_tab_2_df = DataFrame(uzivatele_tab_2)

In [58]:
uzivatele_tab_1_df

     jmeno  vek    mesto
0    Alice   25     Brno
1      Bob   30    Praha
2  Charlie   35    Plzen
3    David   40  Ostrava

In [59]:
uzivatele_tab_2_df

   jmeno  pocet_prijemcu
0  Alice             100
1  David             200
2   Emma             150
3  Frank             250

#### Spojen칤 FULL JOIN

---

In [60]:
mergnute_df = merge(uzivatele_tab_1_df, uzivatele_tab_2_df,
                    on='jmeno',
                    how='outer')

In [61]:
mergnute_df

     jmeno   vek    mesto  pocet_prijemcu
0    Alice  25.0     Brno           100.0
1      Bob  30.0    Praha             NaN
2  Charlie  35.0    Plzen             NaN
3    David  40.0  Ostrava           200.0
4     Emma   NaN      NaN           150.0
5    Frank   NaN      NaN           250.0

#### Spojen칠 INNER MERGE

---

In [62]:
mergnute_inner_df = merge(uzivatele_tab_1_df,
                          uzivatele_tab_1_df,
                          on='jmeno',
                          how='inner')

In [63]:
mergnute_inner_df

     jmeno  vek_x  mesto_x  vek_y  mesto_y
0    Alice     25     Brno     25     Brno
1      Bob     30    Praha     30    Praha
2  Charlie     35    Plzen     35    Plzen
3    David     40  Ostrava     40  Ostrava

Funkce sama **dopln칤 p콏칤pony**, aby rozli코ila **mezi ob캩ma p콢vodn칤mi sloupci**.

**Pokud pot콏ebuje코 vlastn칤 p콏칤pony**, m콢쬰코 vyzkou코et voliteln칳 argument pro `suffixes`:

In [73]:
df8 = DataFrame({
    'jmeno': ['Bob', 'Jake', 'Lisa', 'Sue'],
    'poradi': [1, 2, 3, 4]
})

In [74]:
df9 = DataFrame({
    'jmeno': ['Bob', 'Jake', 'Lisa', 'Sue'],
    'poradi': [3, 1, 4, 2]
})

In [75]:
df8

  jmeno  poradi
0   Bob       1
1  Jake       2
2  Lisa       3
3   Sue       4

In [76]:
df9

  jmeno  poradi
0   Bob       3
1  Jake       1
2  Lisa       4
3   Sue       2

In [77]:
vystup_konflikt = merge(df8, df9, on="jmeno")

In [78]:
vystup_konflikt

  jmeno  poradi_x  poradi_y
0   Bob         1         3
1  Jake         2         1
2  Lisa         3         4
3   Sue         4         2

In [79]:
vystup_vlastni_pripony = merge(df8, df9, on='jmeno', suffixes=('_DF8', '_DF9'))

In [80]:
vystup_vlastni_pripony

  jmeno  poradi_DF8  poradi_DF9
0   Bob           1           3
1  Jake           2           1
2  Lisa           3           4
3   Sue           4           2

Obecn캩 plat칤, 쬰 pokud pot콏ebuje코 *spojit* dva nebo v칤ce `DataFrame` objekt콢 podle **spole캜n칠ho sloupce nebo sloupc콢**, pou쬴j funkci `merge()`.

Pokud chce코 jenom **p콏idat dal코칤 콏치dky nebo sloupce** do existuj칤c칤ho `DataFrame` objektu, pou쬴j funkci `concat`.

In [64]:
uzivatele_tab_1_df

     jmeno  vek    mesto
0    Alice   25     Brno
1      Bob   30    Praha
2  Charlie   35    Plzen
3    David   40  Ostrava

In [65]:
uzivatele_tab_2_df

   jmeno  pocet_prijemcu
0  Alice             100
1  David             200
2   Emma             150
3  Frank             250

In [67]:
vystup_left_join_df = merge(uzivatele_tab_1_df,
                         uzivatele_tab_2_df,
                         on='jmeno',
                         how='left')

In [68]:
vystup_left_join_df

     jmeno  vek    mesto  pocet_prijemcu
0    Alice   25     Brno           100.0
1      Bob   30    Praha             NaN
2  Charlie   35    Plzen             NaN
3    David   40  Ostrava           200.0

V uk치zce v칳코 je pou쬴t칳 *left join*.

Tedy ve v칳sledku uvid칤코 **celou prvn칤** (levou tabulku) a z druh칠 pouze ty z치znamy, kter칠 maj칤 ve spojovac칤m sloupci `jmeno` spole캜nou hodnotu.

### Spojen칤 pomoc칤 index콢, `join`

---

Tato metoda slou쮂 k propojen칤 dvou DataFrame objekt콢 na z치klad캩 **jejich index콢 nebo hodnot**.

Je velice podobn치 funkci `merge` ale je p콏칤mo sou캜치st칤 `DataFrame` objektu a je snaz코칤 ji aplikovat:

In [ ]:
uzivatele_1 = {
    'jmeno': ['Alice', 'Bob', 'Petr'],
     'vek': [25, 30, 35]
}

In [ ]:
uzivatele_2 = {
    'jmeno': ['Alice', 'Bob', 'Petr'],
    'pocet_prijemcu': [100, 150, 200]
}

In [ ]:
df_uzivatele_1 = DataFrame(uzivatele_1)
df_uzivatele_2 = DataFrame(uzivatele_2)

In [ ]:
df_uzivatele_1

In [ ]:
df_uzivatele_2

In [ ]:
df_uzivatele_2.index.names

In [ ]:
df_uzivatele_1 = df_uzivatele_1.set_index('jmeno')

In [ ]:
df_uzivatele_2 = df_uzivatele_2.set_index('jmeno')

In [ ]:
df_uzivatele_1

In [ ]:
df_uzivatele_2

In [ ]:
vysledek_join_metody = df_uzivatele_1.join(df_uzivatele_2)

In [ ]:
vysledek_join_metody

Hlavn칤 rozd칤l mezi t캩mito funkcemi je zp콢sob ur캜en칤 **sloupce nebo sloupc콢**, podle kter칳ch se m치 propojen칤 prov칠st.

1. Metoda `join()` propojuje DataFrame objekty **na z치klad캩 jejich index콢**.
2. Funkce `merge()` umo쮄갓je propojit `DataFrame` objekty **na z치klad캩 hodnoty v jednom nebo v칤ce sloupc칤ch**.

### Souhrn ke spojov치n칤

---

| Objekt | Kdy jej pou쮂셦? | Sm캩r spojen칤 |
| :- | :- | :- |
| `concat` | Kdy chce코 poskl치dat tabulky na sebe (콏치dky) nebo vedle sebe (sloupce). | Vertik치ln캩 / Horizont치ln캩 | 
| `merge` |	Kdy chcete spojit tabulky podle spole캜n칠ho kl칤캜e/sloupce, podobn캩 jako SQL JOIN. | Horizont치ln캩 |
| `join` | Kdy chcete spojit tabulky podle spole캜n칠ho indexu (ne kl칤캜e/sloupce). | Horizont치ln캩 |
| `append` | (Zastaral칠) Pou쮂셨alo se k p콏id치n칤 콏치dk콢, nyn칤 pou쮂셨ejte concat. | Vertik치ln캩 |

<br>

**游 CVI캛EN칈 游, procvi캜 si spojov치n칤**

Tv칳m 칰kolem je propojit tyto tabulky podle zad치n칤:
1. Pou쬴j spojovac칤 funkci pro spojen칤 objekt콢 typu `DataFrame` , kter칠 vytvo콏칤코 z prom캩nn칳ch `data_zamestnanci_1` a `data_zamestnanci_2`,
2. pou쬴j spojovac칤 funkci, kter칠 zad치코 vznikl칳 objekt typu `DataFrame`  z bodu 1. a druh칳 `DataFrame`, kter칳 vytvo콏칤코 z prom캩nn칠 `data_oddeleni` (spoj p콏es sloupe캜ek `"odd캩len칤_id"`),
3. vytvo콏 v칳sledn칳 objekt typu `DataFrame` , kter칳 obsahuje pouze zam캩stnance z odd캩len칤 `IT`.

In [ ]:
data_zamestnanci_1 = {
    'id': [1, 2, 3],
    'jm칠no': ['Jan', 'Marie', 'Petr'],
    'p콏칤jmen칤': ['Nov치k', 'Svobodov치', 'Dvo콏치k'],
    'odd캩len칤_id': [100, 200, 100]
}

data_zamestnanci_2 = {
    'id': [4, 5],
    'jm칠no': ['Anna', 'Josef'],
    'p콏칤jmen칤': ['Kopeck치', 'Vondr치캜ek'],
    'odd캩len칤_id': [200, 100]
}

data_oddeleni = {
    'odd캩len칤_id': [100, 200],
    'n치zev_odd캩len칤': ['IT', 'HR']
}

<details>
    <summary>郊윒잺 콎e코en칤</summary>
    
```python
df_zamestnanci_1 = pd.DataFrame(data_zamestnanci_1)
df_zamestnanci_2 = pd.DataFrame(data_zamestnanci_2)
df_oddeleni = pd.DataFrame(data_oddeleni)

df_vsichni_zamestnanci = pd.concat([df_zamestnanci_1, df_zamestnanci_2], ignore_index=True)

# df1 = pd.concat(
#     [pd.DataFrame(data) for data in [data_zamestnanci_1, data_zamestnanci_2]]
# ).reset_index(drop = True).set_index('id')

df_vsechna_oddeleni = pd.merge(df_vsichni_zamestnanci, df_oddeleni, on="odd캩len칤_id")

df_jen_it = df_vsechna_oddeleni[df_vsechna_oddeleni["n치zev_odd캩len칤"] == "IT"]
```
</details>

## Agregace

---


<img src="https://external-content.duckduckgo.com/iu/?u=https%3A%2F%2Ftse1.mm.bing.net%2Fth%3Fid%3DOIP.HtBtNx6dodlNptXV1QGHWQHaG0%26pid%3DApi&f=1&ipt=3a4d1dfa14a495127b4ece5cf689f00ed0c9e0836853358412e18161ae7c505f&ipo=images" width="160" style="margin-left:auto; margin-right:auto"/>


*Seskupov치n칤* neboli **agregace** jsou procesy, kter칠 pat콏칤 k z치kladn칤 efektivn칤 anal칳ze dat.

### Jednoduch치 agregace

---

P콏esto, 쬰 ve코ker칠 z치kladn칤 **statistick칠 칰daje** prakticky nab칤z칤 metoda `describe()`, m콢쬰코 ocenit, kdy stejnou statistiku m콢쬰코 aplikovat **na tebou vybran칠 objekty**.

Mezi nejjednodu코코칤 postupy, jak data analyzovat pat콏칤 metody jako:
* `sum()`,
* `mean()`,
* `median()`,
* `min()`,
* `max()`.

V코echny tyto metody umo쬹칤 z칤skat jedno samotn칠 캜칤slo, kter칠 ti umo쬹칤 prohl칠dnout podstatu zadan칠ho datasetu.

In [2]:
from pandas import read_csv

In [3]:
df_nemovitosti = read_csv("../onsite/housing.csv")

In [4]:
df_nemovitosti.head()

,id,price,bedrooms,bathrooms,sqft_living,sqft_lot,floors,condition,grade
0,1,221900.0,3,1.00,1180,5650,1,3,7
1,2,538000.0,3,2.25,2570,7242,2,3,7
2,3,180000.0,2,1.00,770,10000,1,3,6
3,4,604000.0,4,3.00,1960,5000,1,5,7
4,5,510000.0,3,2.00,1680,8080,1,3,8

In [13]:
df_nemovitosti.loc[:, "price"].mean()

438075.0

<br>

캛asto ale nen칤 dosta캜uj칤c칤, prozkoumat data pouze jednoduch칳ch agrega캜n칤ch funkc칤.

Dal코칤 operace, kter칠 je pot콏eba pochopit jsou seskupov치n칤 dat podle zadan칳ch parametr콢.

### Seskupov치n칤 GROUPBY

---

Metoda `groupby`, p콢vodn캩 operace z SQL jazyka, je v r치mci knihovny `pandas` v코estran칳 pomocn칤k pro seskupov치n칤 dat na z치klad캩 r콢zn칳ch krit칠ri칤.

In [14]:
from pandas import DataFrame

In [15]:
df_pokus_s_cisly = DataFrame(
    {
        'kl칤캜': ['A', 'B', 'C', 'A', 'B', 'C'],
        '캜칤seln치 hodnota': range(6)},
)

In [16]:
df_pokus_s_cisly

  kl칤캜  캜칤seln치 hodnota
0    A                0
1    B                1
2    C                2
3    A                3
4    B                4
5    C                5

#### Klasick칠 seskupen칤 podle sloupe캜ku

---

In [17]:
df_pokus_s_cisly.groupby("kl칤캜")

In [18]:
type(df_pokus_s_cisly.groupby("kl칤캜"))

pandas.core.groupby.generic.DataFrameGroupBy

Metoda standardn캩 vrac칤 `DataFrameGroupBy`.

Jde op캩t o tzv. *lazy evaluation* proces, samotn칳 nic neprovede, pouze 캜ek치 na pokyn u쬴vatele, kter칳 samotnou agregaci spust칤.

In [19]:
df_pokus_s_cisly.groupby("kl칤캜").sum()

      캜칤seln치 hodnota
kl칤캜
A                   3
B                   5
C                   7

Metoda `sum()` je pouze jednou z mo쬹ost칤, se kterou m콢쬰코 pracovat.

<br>

#### Sloupe캜kov칠 ozna캜ov치n칤

---

Stejn캩 jako `DataFrame` m콢쬰코 ozna캜ovat tak칠 *GroupBy* objekty.

In [20]:
df_pokus_s_cisly

  kl칤캜  캜칤seln치 hodnota
0    A                0
1    B                1
2    C                2
3    A                3
4    B                4
5    C                5

In [21]:
df_pokus_s_cisly.groupby("kl칤캜")["캜칤seln치 hodnota"]

In [22]:
df_pokus_s_cisly.groupby("kl칤캜")["캜칤seln치 hodnota"].median()

kl칤캜
A    1.5
B    2.5
C    3.5
Name: 캜칤seln치 hodnota, dtype: float64

<br>

V uplynul칠 uk치zce je zadan치 seskupov치n칤 podle sloupe캜ku `kl칤캜`.

D치le je vybran칳 pouze konkr칠tn칤 sloupe캜ek, na kter칳 chce코 spustit metodu `median`.

<br>

Pokud pot콏ebuje코 nad vybran칳m objektem prov치d캩t n캩kter칠 procesy ru캜n캩, m콢쬰코 p콏es *GroupBy* objekt **iterovat**:

In [23]:
for (klic, hodnota) in df_pokus_s_cisly.groupby("kl칤캜"):
    print(f"Klic: {klic}; Hodnota={hodnota.shape}")

Klic: A; Hodnota=(2, 2)
Klic: B; Hodnota=(2, 2)
Klic: C; Hodnota=(2, 2)

<br>

### Agregace s metodami

---

Krom캩 jednoduch칳ch agregac칤, nab칤z칤 *GroupBy* 콏adu dal코칤 funkcionality.

Jde o metody:
* `aggregate`,
* `filter`,
* `transform`,
* `apply`.

#### Metoda agregate

---

In [24]:
import numpy

In [25]:
rng = numpy.random.RandomState(0)

In [26]:
from pandas import DataFrame

In [27]:
df_pokus_s_cisly = DataFrame(
    {
        'kl칤캜': ['A', 'B', 'C', 'A', 'B', 'C'],
        'data_1': range(6),
        'data_2': rng.randint(0, 10, 6)
    }
)

In [28]:
df_pokus_s_cisly

  kl칤캜  data_1  data_2
0    A       0       5
1    B       1       0
2    C       2       3
3    A       3       3
4    B       4       7
5    C       5       9

Statistick칠 metody ur캜it캩 nab칤z칤 spousty pom콢cek.

Objekt typu *GroupBy* um칤 pracovat tak칠 s funkcemi, stringy a cel칳mi listy.

In [29]:
df_pokus_s_cisly.groupby("kl칤캜").aggregate("sum")

      data_1  data_2
kl칤캜
A          3       8
B          5       7
C          7      12

In [30]:
df_pokus_s_cisly.groupby("kl칤캜").aggregate(numpy.median)

      data_1  data_2
kl칤캜
A        1.5     4.0
B        2.5     3.5
C        3.5     6.0

In [31]:
df_pokus_s_cisly.groupby("kl칤캜").aggregate(["min", numpy.median, max])

     data_1            data_2
        min median max    min median max
kl칤캜
A         0    1.5   3      3    4.0   5
B         1    2.5   4      0    3.5   7
C         2    3.5   5      3    6.0   9

In [32]:
df_pokus_s_cisly

  kl칤캜  data_1  data_2
0    A       0       5
1    B       1       0
2    C       2       3
3    A       3       3
4    B       4       7
5    C       5       9

M콢쬰코 콏칤ct, 쬰 metoda `aggregate` se pou쮂셨치 k aplikaci **jedn칠 nebo v칤ce agrega캜n칤ch funkc칤 na seskupen치 data**.

```
pobocka,ovoce,prodane_mnozstvi,cena
A,apple,10,20
A,banana,15,12
B,apple,8,22
B,banana,30,10
C,apple,20,18
C,banana,25,15
```

In [ ]:
ovoce_data = {
    'pobocka': ['A', 'A', 'B', 'B', 'C', 'C'],
    'ovoce': ['jablko', 'banan', 'jablko', 'banan', 'jablko', 'banan'],
    'prodane_mnozstvi': [10, 15, 8, 30, 20, 25],
    'cena': [20, 12, 22, 10, 18, 15]
}

In [ ]:
df_ovoce = DataFrame(ovoce_data)

In [ ]:
df_ovoce.head(6)

In [ ]:
vystup = df_ovoce.groupby('pobocka').aggregate({'prodane_mnozstvi': sum})

In [ ]:
vystup = df_ovoce.groupby('pobocka').aggregate({'prodane_mnozstvi': 'sum', 'cena': 'mean'})

In [ ]:
vystup

1. Nejprve jsou hodnoty seskupen칤 podle sloupce `pobocka`,
2. pot칠 specifikuje코 pomoc칤 `aggregate` funkce a sloupce,
3. .. tedy sumarizovat hodnoty v `prodane_mnozstvi` a z칤skat pr콢m캩r `cena` pro ka쬯ou pobo캜ku.

### Filtrov치n칤

---

Filtrov치n칤 ti umo쬹칤 zahodit takov칠 칰daje, kter칠 nespl켿uj칤 zadanou podm칤nku.

Metoda `filter` se pou쮂셨치 k vybr치n칤 **seskupen칳ch dat** podle spln캩n칤 **ur캜it칠 podm칤nky**.

P콏edstavme si, 쬰 m치me n치sleduj칤c칤 dataset s informacemi o prodeji ovoce v r콢zn칳ch obchodech:

```
pobocka,ovoce,prodane_mnozstvi,cena
A,apple,10,20
A,banana,15,12
B,apple,8,22
B,banana,30,10
C,apple,20,18
C,banana,25,15
```

In [34]:
ovoce_data = {
    'pobocka': ['A', 'A', 'B', 'B', 'C', 'C'],
    'ovoce': ['jablko', 'banan', 'jablko', 'banan', 'jablko', 'banan'],
    'prodane_mnozstvi': [10, 15, 8, 30, 20, 25],
    'cena': [20, 12, 22, 10, 18, 15]
}

In [35]:
df_ovoce = DataFrame(ovoce_data)

In [37]:
df_ovoce

  pobocka   ovoce  prodane_mnozstvi  cena
0       A  jablko                10    20
1       A   banan                15    12
2       B  jablko                 8    22
3       B   banan                30    10
4       C  jablko                20    18
5       C   banan                25    15

In [38]:
def vyber_pouze_pobocky_s_prodejem_nad_limit(data, limit: int = 24) -> bool:
    return data['prodane_mnozstvi'].sum() > limit

<br>

Funkce `vyber_pouze_pobocky_s_prodejem_nad_limit`, tedy **filtrovac칤 funkce**, mus칤 vracet **boolean** datov칳 typ.

In [39]:
vysledek = df_ovoce.groupby('pobocka').filter(vyber_pouze_pobocky_s_prodejem_nad_limit)

In [40]:
vysledek

  pobocka   ovoce  prodane_mnozstvi  cena
0       A  jablko                10    20
1       A   banan                15    12
2       B  jablko                 8    22
3       B   banan                30    10
4       C  jablko                20    18
5       C   banan                25    15

1. Nejprve seskup칤코 data podle sloupce `pobocka` pomoc칤 `groupby`,
2. d치le pou쬴je코 metodu `filter`, kter치 umo쮄갓je pou쮂셦 u쬴vatelem definovanou funkci (`vyber_pouze_pobocky_s_prodejem_nad_limit`),
3. definuje코 funkci, kter치 vybere pouze pobo캜ky s v캩t코칤m prodejem ne je parametr `limit`,
4. metoda `filter` pak vybere pouze ty 콏치dky, kter칠 spl켿uj칤 tuto podm칤nku.

### Transformace

---

Zat칤mco p콏edchoz칤 v칳sledky *agregace* pomoc칤 `groupby` vraceli redukovan칠 mno쬽tv칤 dat.

Transformace obvykle vrac칤 data o stejn칠m rozsahu jako vstupn칤 data. Jenom upraven치.

Metoda `transform` se pou쮂셨치 k aplikaci ur캜it칠 **transforma캜n칤 funkce** na ka쬯칳 prvek seskupen칳ch dat.

In [41]:
df_ovoce

  pobocka   ovoce  prodane_mnozstvi  cena
0       A  jablko                10    20
1       A   banan                15    12
2       B  jablko                 8    22
3       B   banan                30    10
4       C  jablko                20    18
5       C   banan                25    15

In [42]:
def vrat_procenta_z_celkoveho_prodeje(udaj) -> float:
    return round(udaj / udaj.sum() * 100, 1)

<br>

Vytvo콏en칤 nov칠ho sloupe캜ku `procento_z_celkoveho_prodeje`:

In [43]:
df_ovoce['procento_z_celkoveho_prodeje'] = df_ovoce.groupby('pobocka')['prodane_mnozstvi'] \
    .transform(vrat_procenta_z_celkoveho_prodeje)

In [44]:
df_ovoce

  pobocka   ovoce  prodane_mnozstvi  cena  procento_z_celkoveho_prodeje
0       A  jablko                10    20                          40.0
1       A   banan                15    12                          60.0
2       B  jablko                 8    22                          21.1
3       B   banan                30    10                          78.9
4       C  jablko                20    18                          44.4
5       C   banan                25    15                          55.6

1. Nejprve seskup칤코 data podle sloupce `pobocka` pomoc칤 `groupby`,
2. d치le pou쬴je코 metodu `transform`, kter치 umo쮄갓je pou쮂셦 u쬴vatelem definovanou funkci,
3. definuje코 funkci, kter치 vybere vypo캜칤t치 procentu치ln칤 vyj치d콏en칤 prodan칠ho zbo쮂 pro pobo캜ku,
4. p콏id치코 nov칳 sloupe캜ek `procento_z_celkoveho_prodeje`.

### Metoda `apply`

---

Metoda `apply` ti tak칠 dovol칤, pou쮂셨at u쬴vatelem definovan칠 funkce na seskupen치 data.

N치sledn캩 vrac칤 objekt knihovny `pandas` (bu캞 `DataFrame`, nebo `Series`, a nebo skal치rn칤 hodnota).

In [45]:
df_ovoce

  pobocka   ovoce  prodane_mnozstvi  cena  procento_z_celkoveho_prodeje
0       A  jablko                10    20                          40.0
1       A   banan                15    12                          60.0
2       B  jablko                 8    22                          21.1
3       B   banan                30    10                          78.9
4       C  jablko                20    18                          44.4
5       C   banan                25    15                          55.6

In [46]:
def vypocitej_vydelek_za_artikl(seskupene):
    seskupene['vydelek_pobocky'] = seskupene['prodane_mnozstvi'] * seskupene['cena']
    return seskupene

<br>

Metoda `apply` je **obecn캩j코칤 a flexibiln캩j코칤** ne `transform`.

`apply` umo쮄갓je pou쮂셦 u쬴vatelem definovanou funkci na ka쬯ou skupinu po seskupen칤 dat pomoc칤 `groupby`.

V칳sledek metody `apply` m콢쬰 m칤t jin칳 tvar ne p콢vodn칤 data.

In [51]:
vystup = df_ovoce.groupby('pobocka', group_keys=False).apply(vypocitej_vydelek_za_artikl)

In [52]:
vystup

,pobocka,ovoce,prodane_mnozstvi,cena,procento_z_celkoveho_prodeje,vydelek_pobocky
0,A,jablko,10,20,40.0,200
1,A,banan,15,12,60.0,180
2,B,jablko,8,22,21.1,176
3,B,banan,30,10,78.9,300
4,C,jablko,20,18,44.4,360
5,C,banan,25,15,55.6,375

In [ ]:
df_ovoce.groupby?

Od posledn칤ch verz칤 frameworku (`1.5.0` a vy코코칤) plat칤, 쬰 pokud bude v칳sledkem `DataFrame` nebo `Series` mus칤코 uv칠st argument pro `group_keys=True`).

<br>

In [53]:
vystup = df_ovoce.groupby('pobocka', group_keys=True).apply(vypocitej_vydelek_za_artikl)

In [54]:
vystup

          pobocka   ovoce  prodane_mnozstvi  cena  \
pobocka
A       0       A  jablko                10    20
        1       A   banan                15    12
B       2       B  jablko                 8    22
        3       B   banan                30    10
C       4       C  jablko                20    18
        5       C   banan                25    15

           procento_z_celkoveho_prodeje  vydelek_pobocky
pobocka
A       0                          40.0              200
        1                          60.0              180
B       2                          21.1              176
        3                          78.9              300
C       4                          44.4              360
        5                          55.6              375

Na prvn칤 pohled vypadaj칤 metody `apply` a `transform` docela podobn캩.

Metoda `transform` je trochu omezen캩j코칤 ne `apply`.

Slou쮂 k aplikaci u쬴vatelem definovan칠 nebo vestav캩n칠 funkce **na ka쬯칳 prvek** skupiny po seskupen칤 s `groupby`.

`transform` mus칤 vracet hodnotu stejn칠ho tvaru jako vstupn칤 data.

V칳sledek metody `transform` **m치 stejn칳 tvar jako p콢vodn칤 data**.

#### Apply
* pot콏ebuje코 v칳sledek, kter칳 **m치 jin칳 tvar ne p콢vodn칤 data**,
* um칤 zpracovat **v칤ce sloupe캜k콢 sou캜asn캩**.

#### Transform
* pot콏ebuje코 v칳sledek, kter칳 **m치 stejn칳 tvar jako p콢vodn칤 data**,
* um칤 zpracovat **pouze jeden sloupe캜ek**.

In [55]:
df_rozdily = DataFrame({
    'KLIC': ['A','B','C'] * 3,
    'A': numpy.arange(9),
    'B': [1,2,3] * 3,
})

In [56]:
df_rozdily

  KLIC  A  B
0    A  0  1
1    B  1  2
2    C  2  3
3    A  3  1
4    B  4  2
5    C  5  3
6    A  6  1
7    B  7  2
8    C  8  3

#### `transform` vrac칤 v칳sledky ve stejn칠m tvaru

---

In [57]:
def vypocitej_sumu(data):
    return data.sum()

In [58]:
seskup_df_rozdily_apply = df_rozdily.groupby('KLIC')['A'].apply(vypocitej_sumu)

In [59]:
seskup_df_rozdily_apply

KLIC
A     9
B    12
C    15
Name: A, dtype: int64

In [60]:
seskup_df_rozdily_trans = df_rozdily.groupby('KLIC')['A'].transform(vypocitej_sumu)

In [61]:
seskup_df_rozdily_trans

0     9
1    12
2    15
3     9
4    12
5    15
6     9
7    12
8    15
Name: A, dtype: int64

#### `apply` um칤 pracovat s v칤ce sloupe캜ky, `transform` jen s jedn칤m

---

In [62]:
df_rozdily

  KLIC  A  B
0    A  0  1
1    B  1  2
2    C  2  3
3    A  3  1
4    B  4  2
5    C  5  3
6    A  6  1
7    B  7  2
8    C  8  3

In [63]:
def vypocitej_rozdil(data):
    return data['B'] - data['A']

In [64]:
df_rozdily.groupby('KLIC').apply(vypocitej_rozdil)

KLIC
A     0    1
      3   -2
      6   -5
B     1    1
      4   -2
      7   -5
C     2    1
      5   -2
      8   -5
dtype: int64

In [66]:
# df_rozdily.groupby('KLIC').transform(vypocitej_rozdil)

<br>

**游 CVI캛EN칈 游, procvi캜 si funkc칤 GroupBy a agrega캜n칤 funkce**

M치코 zadan칳 takov칳 datov칳 set.

N치sledn캩:
1. Pomoc칤 metody `filter` vyber prodejny, kter칠 prodaly **alespo켿 30 produkt콢**,
2. na filtrovan칠m datasetu pou쬴jte metodu `apply` pro v칳po캜et **celkov칠ho p콏칤jmu z prodeje pro ka쬯칳 obchod**.

In [ ]:
from pandas import DataFrame

df_prodej_hardware = DataFrame({
    'prodejna_id': (5, 4, 1, 5, 5, 1, 4, 2, 5, 1, 3, 1, 3, 4, 2, 1, 5, 4, 1, 5),
    'transakce_id': (1278, 1216, 1866, 1872, 1797, 1272, 1880, 1061, 1595, 1879, 1728,
       1341, 1396, 1698, 1018, 1176, 1611, 1395, 1444, 1232),
    'predmet_prodeje': ('grafick치_karta', 'SSD', 'RAM', 'procesor', 'grafick치_karta',
       'z치kladn칤_deska', 'SSD', 'SSD', 'grafick치_karta', 'RAM',
       'grafick치_karta', 'procesor', 'grafick치_karta', 'SSD',
       'grafick치_karta', 'RAM', 'z치kladn칤_deska', 'HDD', 'grafick치_karta',
       'RAM'),
    'pocet_prodanych_ks': (1,  5,  6,  6,  3,  7,  9, 10,  8,  6,  8,  5,  8, 10,  4, 10,  8,
       10,  2,  5),
    'cena_predmetu': (19500.69874949, 19731.10951735, 14114.15342339, 10953.87914371,
        6535.78851758, 16369.00288429, 13852.2578648 ,  3671.03031723,
       18263.08009763, 16539.476237  , 19021.09830919, 14651.53041357,
       12461.59632075,  8655.73920767, 18688.2054254 , 17388.24584526,
        1381.76406707,  1014.1560027 ,  7841.03565412, 16305.78995025)
})

<details>
    <summary>郊윒잺 콎e코en칤</summary>
    
```python
def vyber_prodej_vetsi_nez_limit(data, limit: int = 30):
    return data['pocet_prodanych_ks'].sum() > limit
    
def vypocitej_celkovy_vydelek_prodejny(skupina):
    return (skupina['pocet_prodanych_ks'] * skupina['cena_predmetu']).sum()

df_filtr_hardware = df_prodej_hardware.groupby('prodejna_id') \
                        .filter(vyber_prodej_vetsi_nez_limit)

#         cilove_prodejny = df_prodej_hardware.groupby('prodejna_id') \
# .filter(lambda prodejna: prodejna.pocet_prodanych_ks.sum() >= 30)


celkovy_vydelek = df_filtr_hardware.groupby('prodejna_id') \
                        .apply(vypocitej_celkovy_vydelek_prodejny)

# prodeje_prodejen = cilove_prodejny.groupby('prodejna_id') \
# .aggregate({'pocet_prodanych_ks': sum})

# df_prodej_hardware["prodejna_id"].unique()

# prijmy_prodejen = pd.DataFrame(df_prodej_hardware.groupby('prodejna_id')['cena_predmetu'] \
#                 .apply(lambda prodejna: prodejna.sum())) \
#                 .rename(columns = { 'cena_predmetu': 'prijem_z_prodeje' } ) \
#                 .round( 2 )
```
</details>


<img src="https://external-content.duckduckgo.com/iu/?u=https%3A%2F%2Ftse2.mm.bing.net%2Fth%3Fid%3DOIP.P16hnt14CM-mJ5eAKykxLAHaHa%26pid%3DApi&f=1&ipt=27e3f5b23fe44567ad0730192d5dcb13c7c23aa6e87579d16df05e27461dc12c&ipo=images" width="160" style="margin-left:auto; margin-right:auto"/>

## Pivot tabulky

---

*Pivot tabulky* (*kontingen캜n칤 tabulky*) jsou u쬴te캜n칠 pro p콏ehledn칠 zobrazen칤 a anal칳zu dat z tabulkov칳ch zdroj콢.

Pomoc칤 pivot tabulek m콢쬰코 **seskupit data podle ur캜it칳ch kategori칤** a prov칠st agregaci hodnot.

Nejprve si p콏edstav situaci bez pivot tabulek, pomoc칤 uk치zky n칤쬰:

In [67]:
import seaborn

<br>

V t칠to ukazce pou쬴je코 vzorov치 data t칳kaj칤c칤 se [nehody lodi Titanic](https://en.wikipedia.org/wiki/Sinking_of_the_Titanic):

In [68]:
df_titanic = seaborn.load_dataset('titanic')

In [69]:
df_titanic.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

<br>

Pro jakoukoliv pokro캜ilou anal칳zu dat, pot콏ebuje코 칰daj seskupit.

Tak jak jsi do prov치d캩l doposud, pomoc칤 `groupby`:

In [70]:
df_titanic["sex"].unique()

array(['male', 'female'], dtype=object)

In [71]:
df_titanic.groupby('sex')

<br>

Pot콏ebuje코 pr콢m캩rnou hodnotu, a콘 je na sloupe캜ku `survived` vid캩t pom캩r p콏e쬴v코칤ch:

In [72]:
df_titanic.groupby('sex')['survived'].mean()

sex
female    0.742038
male      0.188908
Name: survived, dtype: float64

<br>

Pro lep코칤 캜itelnost **zaokrouhl칤m v칳sledek na dv캩 desetinn칠 캜칤sla**:

In [73]:
df_titanic.groupby('sex')['survived'].mean().round(2)

sex
female    0.74
male      0.19
Name: survived, dtype: float64

Takov칳 pr콢zkum z t칠to studie ti d치 jasn칳 pohled na v캩c:
* 3 ze 4 쬰n p콏e쬴ly,
* 1 z 5 mu쮄 p콏e쬴l.

<br>

Pokud bude코 pot콏ebovat detailn캩j코칤 anal칳zy, bude코 pot콏ebovat v칤ce dat.

T콏eba situaci, kde krom캩 pohlav칤, bere코 v potaz **t콏칤du cestuj칤c칤ch** `class`:

In [74]:
df_titanic["class"].unique()

['Third', 'First', 'Second']
Categories (3, object): ['First', 'Second', 'Third']

In [75]:
df_titanic.groupby(['sex', 'class'])[['survived']].mean()

               survived
sex    class
female First   0.968085
       Second  0.921053
       Third   0.500000
male   First   0.368852
       Second  0.157407
       Third   0.135447

In [76]:
type(df_titanic.groupby(['sex', 'class'])[['survived']])

pandas.core.groupby.generic.DataFrameGroupBy

In [77]:
type(df_titanic.groupby(['sex', 'class'])['survived'].mean())

pandas.core.series.Series

In [78]:
df_titanic.groupby(['sex', 'class'])[['survived']].mean().round(2)

               survived
sex    class
female First       0.97
       Second      0.92
       Third       0.50
male   First       0.37
       Second      0.16
       Third       0.14

<br>

Metodou `unstack` si m콢쬰코 vytvo콏it nov칠 sloupe캜ky, kter칠 jsou postaven칠 na nov칠m Indexu, nebo Indexech (*Multiindex*):

In [79]:
df_titanic.groupby(['sex', 'class'])['survived'].mean().round(2).unstack()

class   First  Second  Third
sex
female   0.97    0.92   0.50
male     0.37    0.16   0.14

Takov칳 pr콢zkum ti d치 skute캜n캩 lep코칤 pohled na v캩c.

Sou캜asn캩 ale roste **n치ro캜nost ohl치코en칤**.

Z치pis "bobtn치" a **st치v치 se n치ro캜n캩j코칤m na p콏e캜ten칤 a pochopen칤**.

<br>

### Pivot tabulka

---

Podobn칠 콏e코en칤 ti nab칤z칤 funkce `pivot_table`:

In [80]:
df_titanic.groupby(['sex', 'class'])['survived'].mean().round(2).unstack()

class   First  Second  Third
sex
female   0.97    0.92   0.50
male     0.37    0.16   0.14

In [82]:
df_titanic.pivot_table('survived', index='sex', columns='class').round(2)

sex     female  male
class
First     0.97  0.37
Second    0.92  0.16
Third     0.50  0.14

Z치s치dn칤m rozd칤lem je ov코em **캜itelnost**, kterou m치코 pro tuto variantu z치pisu.

```
Clarity beats purity
```

Pomoc칤 vhodn칳ch argument콢, m콢쬰코 doplnit vysv캩tlivky tam, kde funkce `groupby` nemohla.

Stejn캩 plat칤, 쬰 pokud bude코 pot콏ebovat **dal코칤 Index**, m콢쬰코 si pomoci funkc칤 `cut`:

In [83]:
df_titanic.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

In [84]:
df_titanic['age'].describe()

count    714.000000
mean      29.699118
std       14.526497
min        0.420000
25%       20.125000
50%       28.000000
75%       38.000000
max       80.000000
Name: age, dtype: float64

In [85]:
from pandas import cut

In [86]:
age = cut(df_titanic['age'], [1, 25, 80])

In [87]:
age  # < xxx , xxx )

0       (1.0, 25.0]
1      (25.0, 80.0]
2      (25.0, 80.0]
3      (25.0, 80.0]
4      (25.0, 80.0]
           ...
886    (25.0, 80.0]
887     (1.0, 25.0]
888             NaN
889    (25.0, 80.0]
890    (25.0, 80.0]
Name: age, Length: 891, dtype: category
Categories (2, interval[int64, right]): [(1, 25] < (25, 80]]

In [88]:
df_titanic.pivot_table('survived', index=['sex', age], columns='class').round(2)

class            First  Second  Third
sex    age
female (1, 25]    0.93    0.97   0.48
       (25, 80]   0.98    0.89   0.38
male   (1, 25]    0.46    0.16   0.14
       (25, 80]   0.38    0.08   0.15

Pomoc칤 funkce `cut` dopln칤코 tabulku na **MultiIndex**.

Ten nyn칤 vytvo콏칤 i rozsah pro v캩kovou kategorii.

<br>

**游 CVI캛EN칈 游, procvi캜 si pivot tabulky**

Ze zadan칠ho datasetu vytvo콏 **pivot tabulku**, kter치 zobraz칤 **po캜et prodan칳ch kus콢 ovoce** pro **ka쬯칳 obchod** a **druh ovoce**.

In [89]:
ovoce_data = {
    'pobocka': ['A', 'A', 'B', 'B', 'C', 'C'],
    'ovoce': ['jablko', 'banan', 'jablko', 'banan', 'jablko', 'banan'],
    'prodane_mnozstvi': [10, 15, 8, 30, 20, 25],
    'cena': [20, 12, 22, 10, 18, 15]
}

In [ ]:
# pivot_table()

<details>
    <summary>郊윒잺 콎e코en칤</summary>
    
```python
pivot_tabulka = df_ovoce.pivot_table(values="prodane_mnozstvi", index="pobocka", columns="ovoce")
```
</details>

---